Pandas Foundation

In [1]:
import numpy as np
import pandas as pd

stocks = pd.read_table('../dataBank/messy_stock_data.tsv')
stocks

  The following stock data was collect on 2016-AUG-25 from an unknown source
0  These kind of ocmments are not very useful, ar...
1  probably should just throw this line away too,...
2  name Jan Feb Mar Apr May Jun Jul Aug Sep Oct N...
3  # So that line you just read has all the colum...
4  IBM 156.08 160.01 159.81 165.22 172.25 167.15 ...
5  MSFT 45.51 43.08 42.13 43.47 47.53 45.96 45.61...
6                           # That MSFT is MicroSoft
7  GOOGLE 512.42 537.99 559.72 540.50 535.24 532....
8  APPLE 110.64 125.43 125.97 127.29 128.76 127.8...
9  # Maybe we should have bought some Apple stock...

In [2]:
Month = stocks.values[2]
IBM = stocks.values[4]
MSFT = stocks.values[5]
GOOGLE = stocks.values[7]
APPLE = stocks.values[8]
z_data = [Month,IBM,MSFT,GOOGLE,APPLE]

In [3]:
def split_to_list(data):
    b_arr = []
    for arr in data:
        for item in arr:
            n_item = item.split(" ")
            b_arr.append(n_item)
    return b_arr
    
df_list = split_to_list(z_data)

In [4]:
type(df_list)

list

In [5]:
df_stocks = pd.DataFrame(df_list[1:], columns=df_list[0]).set_index(['name'])
df_stocks

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
name,,,,,,,,,,,,
IBM,156.08,160.01,159.81,165.22,172.25,167.15,164.75,152.77,145.36,146.11,137.21,137.96
MSFT,45.51,43.08,42.13,43.47,47.53,45.96,45.61,45.51,43.56,48.70,53.88,55.40
GOOGLE,512.42,537.99,559.72,540.50,535.24,532.92,590.09,636.84,617.93,663.59,735.39,755.35
APPLE,110.64,125.43,125.97,127.29,128.76,127.81,125.34,113.39,112.80,113.36,118.16,111.73

In [6]:
df_stocks.info() #all values are strings and need to be converted to float

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, IBM to APPLE
Data columns (total 12 columns):
Jan    4 non-null object
Feb    4 non-null object
Mar    4 non-null object
Apr    4 non-null object
May    4 non-null object
Jun    4 non-null object
Jul    4 non-null object
Aug    4 non-null object
Sep    4 non-null object
Oct    4 non-null object
Nov    4 non-null object
Dec    4 non-null object
dtypes: object(12)
memory usage: 416.0+ bytes

In [7]:
df_stocks['Jan'].astype(float)

name
IBM       156.08
MSFT       45.51
GOOGLE    512.42
APPLE     110.64
Name: Jan, dtype: float64

In [8]:
def str_to_float(df):
    months = df.columns
    for month in months:
        df[month] = df[month].astype(float)
    return df

df_stocks = str_to_float(df_stocks)
df_stocks.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, IBM to APPLE
Data columns (total 12 columns):
Jan    4 non-null float64
Feb    4 non-null float64
Mar    4 non-null float64
Apr    4 non-null float64
May    4 non-null float64
Jun    4 non-null float64
Jul    4 non-null float64
Aug    4 non-null float64
Sep    4 non-null float64
Oct    4 non-null float64
Nov    4 non-null float64
Dec    4 non-null float64
dtypes: float64(12)
memory usage: 576.0+ bytes

In [9]:
df_stocks.describe()

,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
count,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000,4.000000
mean,206.162500,216.627500,221.907500,219.120000,220.945000,218.460000,231.447500,237.127500,229.912500,242.940000,261.160000,265.110000
std,209.153601,219.784073,230.577057,220.208981,215.811172,215.632001,244.177106,270.132378,262.138194,283.338799,318.157033,328.636622
min,45.510000,43.080000,42.130000,43.470000,47.530000,45.960000,45.610000,45.510000,43.560000,48.700000,53.880000,55.400000
25%,94.357500,104.842500,105.010000,106.335000,108.452500,107.347500,105.407500,96.420000,95.490000,97.195000,102.090000,97.647500
50%,133.360000,142.720000,142.890000,146.255000,150.505000,147.480000,145.045000,133.080000,129.080000,129.735000,127.685000,124.845000
75%,245.165000,254.505000,259.787500,259.040000,262.997500,258.592500,271.085000,273.787500,263.502500,275.480000,286.755000,292.307500
max,512.420000,537.990000,559.720000,540.500000,535.240000,532.920000,590.090000,636.840000,617.930000,663.590000,735.390000,755.350000

In [ ]:
df_stocks.T.plot()